# _*_ coding: utf-8 _*_

"""
定义用户画像中职业的配置信息
"""

config_job_tags = {

    "driver": ["司机端", "司机版"],

    "teacher": ["教师端", "教师版", "老师端", "老师版", "教师资格"],

    "doctor": ["医生端", "医生版", "医生资格", "医生执业", "医生助手"],

    "nurse": ["护士端", "护士版", "护士资格", "护士执业", "护士助理", "护士助手"],

    "lawyer": ["律师端", "律师版", "律师资格", "律师执业", "律师圈", "律师助理", "律师助手"],

    "accountant": ["会计从业", "会计资格", "会计考试", "会计证", "会计圈"],

    "banker": ["银行从业", "基金从业", "期货从业", "证券从业"],

    "coder": ["程序员", "程序猿", "c++", "java", "python", "php", "c语言", "r语言", "c#", "javascript"],

    "postman": ["快递员", "快递员版"],

    "HR": ["人力资源"],

    "sale": ["销售员", "店员版", "店员端", "店员APP"],

    "manicurist": ["美甲师", "美甲帮", "美甲设计师"],

    "seller": ["商家", "商家版", "商家端", "商家专用"],
}
