# _*_ coding: utf-8 _*_

"""
定义用户画像中性别的配置信息
"""

config_gender_dict = {
    "male": 0,
    "female": 1,
}

config_gender_string = ["male", "female"]

config_gender_int = [0, 1]

# 根据app_content, app_name或者tag_list进行匹配
config_gender_tags = {

    "male": [
        ["健身", "肌肉", "硬汉", "胸肌", "腹肌", "强壮", "壮汉"],
        ["汽车", "驾驶", "选车", "购车", "养车", "修车", "赛车", "玩车", "二手车", "车友", "车迷", "车险", "4s店", "违章"],
        ["体坛", "体育赛事", "体育直播", "球队", "球员", "看球", "橄榄球", "篮球", "nba", "cba", "足球", "亚冠", "欧冠", "冠军杯", "中超", "意甲", "德甲", "法甲", "英超", "西甲"],
        ["越野", "越野赛", "狂飙", "飙车", "射击", "军团", "军事", "坦克", "枪战", "战争", "地狱", "暴徒", "格斗", "犯罪", "血腥", "怪物"],
        ["创业", "创业者", "创业项目", "投资人", "风投", "企业", "企业家", "工业"],
        ["戒烟", "吸烟", "抽烟", "香烟", "烟民", "烟毒", "二手烟", "男性健康", "男科", "补肾", "肾虚", "肾阴", "肾阳", "肾病", "肾亏"],
    ],

    "female": [
        ["美图", "美颜", "美肤", "美肌", "美照", "美拍", "自拍"],
        ["美容", "美妆", "美甲", "美瞳", "美胸", "眼妆", "化妆", "丰胸", "瑜伽"],
        ["准妈妈", "备孕", "受孕", "怀孕", "避孕", "孕妇", "孕前", "孕期", "怀孕期", "怀胎", "排卵期", "预产期", "产检", "产后", "分娩", "生育", "胎儿", "胎教"],
        ["妈咪", "辣妈", "母乳", "哺乳期", "宝宝", "母婴", "育儿", "早教", "幼教", "婴儿", "婴幼儿", "妊娠", "妊娠纹", "月子", "坐月子", "亲子"],
        ["大姨妈", "经期", "月经", "月经期", "生理期", "安全期", "例假", "例假期", "危险期", "肚子疼", "妇科", "妇产科"],
        ["保湿", "护肤", "文胸", "面膜", "腮红", "口红", "耳环", "香水", "裙子", "短裙", "套装", "韩版", "婚纱"],
    ],

}

# gender判定的黑名单
config_gender_blacklist = {

    "name": ["百度", "手机百度", "qq", "手机qq", "微信", "微博", "支付宝", "京东", "京东钱包",
             "淘宝", "手机淘宝", "天猫", "今日头条", "58同城", "去哪儿旅行", "去哪儿酒店", "携程旅行",
             "爱奇艺视频", "腾讯视频", "优酷视频", "土豆视频", "搜狐视频", "百度视频", "360影视大全",
             "陌陌", "易信", "触宝电话", "美团", "大众点评", "窝窝团", "百度糯米"],

    "keywords": ["输入法", "地图", "银行", "浏览器", "万能钥匙", "邮箱", "文件管理", "新闻", "播放器",
                 "清理大师", "安全大师", "安全管家", "安全中心", "安全卫士", "安全市场", "360卫士",
                 "手机助手", "手机管家", "手机卫士", "同步助手", "pptv", "wifi", "wps", "掌阅", "保险"],

}
