# _*_ coding: utf-8 _*_

"""
定义用户画像中年龄的配置信息
"""

config_age_dict = {
    "16-19": 0,
    "20-25": 1,
    "26-30": 2,
    "31-35": 3,
    "36-45": 4,
    ">45": 5,
}

config_age_string = ["16-19", "20-25", "26-30", "31-35", "36-45", ">45"]

config_age_int = [0, 1, 2, 3, 4, 5]

# 根据app_name或者tag_list进行匹配
config_age_tags = {

    "16-19": ["高中", "高考", "报考", "作业帮", "猿题库"],

    "20-25": ["大学", "校园", "课程表", "师兄", "师姐", "四级", "六级", "商务英语", "托业英语", "托福", "雅思", "gre", "留学", "论文", "实习", "考研", "公务员", "读书", "兼职"],

    "26-30": ["孕", "胎儿", "胎教", "安胎", "养胎", "上班", "工作", "招聘", "白领", "办公室", "股票"],

    "31-35": ["爸爸", "妈妈", "母婴", "育儿", "幼教", "婴儿", "幼儿", "亲子", "财经", "期货"],

    "36-45": ["幼儿园", "小学", "小学生", "小升初", "初中", "中考", "作业"],

    ">45": ["老人", "老年", "养老", "广场舞", "糖尿病"],

}

# age判定的黑名单
config_age_blacklist = {

    "name": ["百度", "手机百度", "qq", "手机qq", "微信", "微博", "支付宝"],

    "keywords": ["地图", "银行"],

}
